cf/DataProcessors/BookkeepingPosting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>BookkeepingPosting</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DynamicFilter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DisplayedDocumentsStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DocumentBookkeepingStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTypes</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnlyChoosenTypes</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SelectTopX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortingMethod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TopSelectionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManualBookkeepingOperation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChooseFromList</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>DocumentList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Check</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DocumentBookkeepingStatus</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationTemplate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BookkeepingOperationsTemplates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperation</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.BookkeepingOperation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Remarks</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentAuthor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentComment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationPosted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationDeletionMark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationAuthor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationComment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationManual</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionState</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ActionStates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ChoosenDocumentsFromList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/BookkeepingPostedDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>BookkeepingPostedDocuments</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DocumentBookkeepingStatus</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>_PostedOfBookkeepingOperation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_PostedOfDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_BookkeepingOperation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BookkeepingOperation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_BookkeepingOperationTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BookkeepingOperationsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentType</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/DocumentBookkeepingStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>DocumentBookkeepingStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotBookkeepingPosted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BookkeepingPosted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BookkeepingPostingIsNotAllowed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ActionStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ActionStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotExecuted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PerformedError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Performed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/BookkeepingPosting/Ext/ManagerModule.bsl
Procedure LoadTabularPartFromQueryResult(Val DocumentListVT, Val QueryResultVT, Val StorageAddress) Export
	
	If QueryResultVT.Count()>0 Then
		Percentage100Count = QueryResultVT.Count();
		OneDocumentStep = 100/Percentage100Count;
		IncrementalCounter = 0;
		
		For Each Selection In QueryResultVT Do
			
			IncrementalCounter = IncrementalCounter + OneDocumentStep;
			DataProcessors.BookkeepingPosting.AddTabularPartRow(DocumentListVT,Selection);
			LongActionsServer.WriteProgress(IncrementalCounter);
			
		EndDo;
	EndIf;
	
	PutToTempStorage(DocumentListVT,StorageAddress);
	
EndProcedure	

Procedure AddTabularPartRow(DocumentListVT, Val Selection) Export
	
	NewRow = DocumentListVT.Add();
	
	If Selection.BookkeepingOperationRef = Null Then
		
		BookkeepingOperationTemplate = Undefined;
		Result = BookkeepingCommon.GetRecommendSchemaForDocument(Selection.Document, BookkeepingOperationTemplate, False);
		
		If Result = 0 Then
			NewRow.Remarks = Nstr("en = 'There is no bookkeeping operation template found'; pl = 'Nie znaleziono pasującego schematu księgowania'");
		ElsIf Result = 1 Then
			NewRow.BookkeepingOperationTemplate = BookkeepingOperationTemplate;
		ElsIf Result = 2 Then
			NewRow.Remarks = Nstr("en = 'There are more than one bookkeeping operation template found, corresponding to filter'; pl = 'Istnieje więcej niz jeden pasujacy schemat, który zawiera filtr'");
		ElsIf Result = 3 Then
			NewRow.Remarks = Nstr("en = 'There are more than one bookkeeping operation template found'; pl = 'Istnieje więcej niz jeden pasujacy schemat'");
		EndIf;
		
	Else
		
		NewRow.BookkeepingOperationTemplate = Selection.BookkeepingOperationTemplate;
		
	EndIf;
	
	NewRow.Document = Selection.Document;
	NewRow.DocumentAuthor = Selection.DocumentAuthor;
	NewRow.DocumentComment = Selection.DocumentComment;
	NewRow.Status = Selection.Status;
	NewRow.BookkeepingOperation = Selection.BookkeepingOperationRef;
	NewRow.BookkeepingOperationPosted = Selection.BookkeepingOperationPosted;
	NewRow.BookkeepingOperationDeletionMark = Selection.BookkeepingOperationDeletionMark;
	NewRow.BookkeepingOperationNumber = Selection.BookkeepingOperationNumber;
	NewRow.BookkeepingOperationAuthor = Selection.BookkeepingOperationAuthor;
	NewRow.BookkeepingOperationManual = Selection.BookkeepingOperationManual;
	NewRow.BookkeepingOperationComment = Selection.BookkeepingOperationComment;
	
EndProcedure	

Procedure ProcessTabularPartRows(Val CommandStructure, Val DocumentListVT, Val DynamicFilter, Val DisplayedDocumentsStatus, Val StorageAddress) Export
	
	DocumentListCount = DocumentListVT.Count();
	StepProgress = 100 / DocumentListCount;
	Progress = 0;
	
	i = 1;
	While i<=DocumentListCount Do
		
		DocumentsListRow = DocumentListVT[i-1];
		
		i = i + 1;
		
		Progress = Progress + StepProgress;
		
		LongActionsServer.WriteProgress(Progress);
		
		If Not DocumentsListRow.Check Then
			Continue;
		EndIf;
		
		CheckStatus = DisplayedDocumentsStatus;
		If CommandStructure.Name = "SetStatus" Then
			
			If CommandStructure.NewStatus = Enums.DocumentBookkeepingStatus.BookkeepingPostingIsNotAllowed 
				And Not DocumentsListRow.BookkeepingOperation.IsEmpty() Then
				DocumentsListRow.Remarks = Nstr("en='Document could not be marked as such that should not be bookkeeping posted, because it already has bookkeeping operation!';pl='Nie można oznaczyć dokument jak taki, któy się nie księguje bo dokument już posiada DK!';ru='Документ, который уже проведен нельзя отметить как документ, который не проводится!'");
				Continue;
			EndIf;
			
			SetDocumentsStatus(DocumentsListRow, CommandStructure.NewStatus, CommandStructure.NewComment);
			
			CheckStatus = CommandStructure.NewStatus;
			
		ElsIf CommandStructure.Name = "UndoPosting" Then
			
			If Not DocumentsListRow.BookkeepingOperationPosted Then
				Continue;
			EndIf;
		
			BOObject = DocumentsListRow.BookkeepingOperation.GetObject();
			BOObject.Write(DocumentWriteMode.UndoPosting);
			
			SetDocumentsStatus(DocumentsListRow, Enums.DocumentBookkeepingStatus.NotBookkeepingPosted, "");
			
			CheckStatus =  Enums.DocumentBookkeepingStatus.NotBookkeepingPosted;
			
		ElsIf CommandStructure.Name = "Posting" Then
			
			If DocumentsListRow.BookkeepingOperationTemplate.IsEmpty() Then
				Continue;
			EndIf;
		
			If DocumentsListRow.BookkeepingOperation.IsEmpty() Then
				DocumentBookkeepingOperation = Documents.BookkeepingOperation.CreateDocument();
				DocumentBookkeepingOperation.Author = SessionParameters.CurrentUser;
			Else
				DocumentBookkeepingOperation = DocumentsListRow.BookkeepingOperation.GetObject();
			EndIf;
			
			If DocumentBookkeepingOperation.Manual = False Then
				DocumentBookkeepingOperation.FillingOnDocumentBaseAndTemplate(DocumentsListRow.Document, DocumentsListRow.BookkeepingOperationTemplate);
				BookkeepingOperationsTemplateObject = DocumentsListRow.BookkeepingOperationTemplate.GetObject();
				BookkeepingOperationsTemplateObject.FillBookkeepingDocument(DocumentsListRow.Document, DocumentBookkeepingOperation);
			Else
				MessageText = Alerts.ParametrizeString(Nstr("en = 'Records generation was not done for document %P1, because it has setted property ""Allow changes""!'; pl = 'Generowanie aktualnych zapisów dla dokumentu %P1 nie została dokonana, ponieważ dokument ma ustawioną cechę ""Pozwól na zmiany""'"), New Structure("P1", DocumentsListRow.Document));
				DocumentsListRow.Remarks = DocumentsListRow.Remarks + MessageText;
				Alerts.AddAlert(MessageText);
			EndIf;	
		
			Try
				
				If CommandStructure.IsDraft Then
					WriteMode = DocumentWriteMode.Write;
					RemarkText = Nstr("en='Document was bookkeeping created successfully';pl='Dowód księgowy został utworzony poprawnie'");
					If DocumentBookkeepingOperation.Posted Then
						Status = Enums.DocumentBookkeepingStatus.BookkeepingPosted;
					Else
						Status = Enums.DocumentBookkeepingStatus.NotBookkeepingPosted;
					EndIf;
				Else
					WriteMode = DocumentWriteMode.Posting;
					RemarkText = Nstr("en = 'Document was bookkeeping posted successfully'; pl = 'Dokument zaksięgowany poprawnie'");
					Status = Enums.DocumentBookkeepingStatus.BookkeepingPosted;
				EndIf;
				
				DocumentBookkeepingOperation.Write(WriteMode);
				DocumentsListRow.BookkeepingOperation = DocumentBookkeepingOperation.Ref;
				DocumentsListRow.BookkeepingOperationPosted = DocumentBookkeepingOperation.Posted;
				DocumentsListRow.BookkeepingOperationNumber = DocumentBookkeepingOperation.Number;
				DocumentsListRow.Remarks = RemarkText;
				DocumentsListRow.Status = Status;
				DocumentsListRow.ActionState = Enums.ActionStates.Performed;
				
			Except
				
				MessageText = Alerts.ParametrizeString(Nstr("en = 'Bookkeeping posting of document %P1 fails!'; pl = 'Księgowanie dokumentu %P1 nie powiodło się!'"), New Structure("P1", DocumentsListRow.Document));
				DocumentsListRow.Remarks = DocumentsListRow.Remarks + MessageText;
				DocumentsListRow.ActionState = Enums.ActionStates.PerformedError;
				Alerts.AddAlert(MessageText);
				
			EndTry;
			
			CheckStatus = Status;
			
		EndIf;
		
		If DynamicFilter AND CheckStatus <> DisplayedDocumentsStatus Then
			
			i = i - 1;
			DocumentListVT.Delete(i-1);
			DocumentListCount = DocumentListCount - 1;
			
		EndIf;
		
	EndDo;	
	
	PutToTempStorage(DocumentListVT,StorageAddress);
	
EndProcedure	

Procedure SetDocumentsStatus(DocumentsListRow,Val NewStatus,Val StatusComment) Export
	
	BeginTransaction(DataLockControlMode.Managed);
	
	DataLock = New DataLock;
	DataLockItem = DataLock.Add("InformationRegister.BookkeepingPostedDocuments");
	DataLockItem.Mode = DataLockMode.Exclusive;
	DataLockItem.SetValue("Document",DocumentsListRow.Document);
	DataLock.Lock();
	
	RecordSet = InformationRegisters.BookkeepingPostedDocuments.CreateRecordSet();
	RecordSet.Filter.Document.Set(DocumentsListRow.Document);
	RecordSet.Read();
	
	If RecordSet.Count() = 0 Then
		Record = RecordSet.Add();
	Else
		Record = RecordSet[0];
	EndIf;
	
	Record.Status = NewStatus;
	If NewStatus = Enums.DocumentBookkeepingStatus.BookkeepingPostingIsNotAllowed Then
		Record.Author = SessionParameters.CurrentUser;
		Record.Comment = StatusComment;
	ElsIf DocumentsListRow.BookkeepingOperation.IsEmpty() Then
		Record.Author = Undefined;
		Record.Comment = Undefined;
	EndIf;
	
	RecordSet.SetProgramBookkeepingPostingFlag();
	
	Cancel = False;
	
	Try
		
		RecordSet.Write();
		
		DocumentsListRow.Status = NewStatus;
		
		If NewStatus = Enums.DocumentBookkeepingStatus.BookkeepingPostingIsNotAllowed Then
			DocumentsListRow.BookkeepingOperationAuthor = SessionParameters.CurrentUser;
			DocumentsListRow.BookkeepingOperationComment = StatusComment;
		ElsIf DocumentsListRow.BookkeepingOperation.IsEmpty() Then
			DocumentsListRow.BookkeepingOperationAuthor = Undefined;
			DocumentsListRow.BookkeepingOperationComment = Undefined;
		EndIf;
		
	Except
		
		MessageText = Alerts.ParametrizeString(Nstr("en = 'Changing status of document %P1 fails!'; pl = 'Zmiana statusu dokumentu %P1 nie powiodła się!'"), New Structure("P1", DocumentsListRow.Document));
		Alerts.AddAlert(MessageText,,Cancel);
		DocumentsListRow.Remarks = ErrorInfo().Description;
		
	EndTry;
	
	If Cancel Then
		RollbackTransaction();
	Else
		CommitTransaction();
	EndIf;	
	
EndProcedure
